app/Controllers/Categorias.php

    public function show ($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1

    public function delete($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();

        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers) && !empty($headers['Authorization'])){
                if($request->getHeader('Authorization')=='Authorization: Basic '.base64_encode($value['cliente_id'].':'.$value['llave_secreta'])){
                    $model = new CategoriasModel();
                    $categoria = $model->where('estado',1)->find($id);
                    if(!empty($categoria)){
                        $datos = array("estado"=>0);
                        $categoria = $model->update($id, $datos);
---
SELECT *
FROM `registros`
WHERE `estado` = 1
UPDATE `categoria` SET `estado` = 0
WHERE `categoria`.`idcategoria` IN ('2')