app/Controllers/Clientes.php

    public function create(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1


                                );
                                $model = new ClientesModel();
                                $cliente = $model->insert($datos);
---
INSERT INTO `clientes` (`nombreCliente`, `apellidoCliente`, `emailCliente`) VALUES ('Pablo Escobar', 'Gavidia', 'Gavidia.escobar@gmail.com')