app/Controllers/Objetivos.php

SELECT *
FROM `registros`
WHERE `estado` = 1
---
    public function show ($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();