app/Models/CategoriasModel.php

  public function getCategorias()
  {
    return $this->db->table('categoria c')
      ->Where('c.estado', 1)
      /*->join('producto p', 'c.idcategoria = p.idproducto')*/
      ->get()->getResultArray();
---
SELECT *
FROM `categoria` `c`
JOIN `objetivos` `ob` ON `c`.`idcategoria` = `ob`.`idobjetivos`
WHERE `c`.`idcategoria` = '2'
AND `c`.`estado` = 1