app/Models/ClientesModel.php

  public function getClientes()
  {
    return $this->db->table('clientes cl')
      ->Where('cl.estado', 1)
---
SELECT *
FROM `clientes` `cl`
WHERE `cl`.`estado` = 1