app/Models/ObjetivosModel.php

SELECT *
FROM `objetivos` `ob`
JOIN `situacion` `st` ON `ob`.`idsituacion` = `st`.`idsituacion`
WHERE `ob`.`idobjetivos` = '2'
AND `ob`.`estado` = 1
---
  public function getId($id)
  {
    return $this->db->table('objetivos ob')
    ->Where('ob.idobjetivos',$id)
      ->Where('ob.estado', 1)
      ->join('situacion st', 'ob.idsituacion = st.idsituacion')
      ->get()->getResultArray();