app/Models/OpinionesModel.php

SELECT *
FROM `comentarios` `cmt`
JOIN `clientes` `cl` ON `cmt`.`idclientes` = `cl`.`idclientes`
WHERE `cmt`.`estado` = 1
---
  public function getOpiniones()
  {
    return $this->db->table('comentarios cmt')
      ->Where('cmt.estado', 1)
      ->join('clientes cl', 'cmt.idclientes = cl.idclientes')
      ->get()->getResultArray();

SELECT *
FROM `comentarios` `cmt`
JOIN `clientes` `cl` ON `cmt`.`idclientes` = `cl`.`idclientes`
WHERE `cmt`.`idcomentarios` = '1'
AND `cmt`.`estado` = 1
---
  public function getId($id)
  {
    return $this->db->table('comentarios cmt')
    ->Where('cmt.idcomentarios',$id)
    ->Where('cmt.estado', 1)
    ->join('clientes cl', 'cmt.idclientes = cl.idclientes')
    ->get()->getResultArray();