app/Models/ProductosModel.php

  public function getProductos()
  {
    return $this->db->table('producto p')
      ->Where('p.estado', 1)
      ->join('categoria c', 'p.idcategoria = c.idcategoria')
      ->get()->getResultArray();
---
SELECT *
FROM `producto` `p`
JOIN `categoria` `c` ON `p`.`idcategoria` = `c`.`idcategoria`
WHERE `p`.`estado` = 1

  public function getId($id)
  {
    return $this->db->table('producto p')
    ->Where('p.idproducto',$id)
      ->Where('p.estado', 1)
      ->join('categoria c', 'p.idcategoria = c.idcategoria')
      ->get()->getResultArray();
---
SELECT *
FROM `producto` `p`
JOIN `categoria` `c` ON `p`.`idcategoria` = `c`.`idcategoria`
WHERE `p`.`idproducto` = '2'
AND `p`.`estado` = 1