app/Models/SituacionModel.php

SELECT *
FROM `situacion` `st`
WHERE `st`.`idsituacion` = '1'
AND `st`.`estado` = 1
---
  public function getId($id)
  {
    return $this->db->table('situacion st')
      ->Where('st.idsituacion', $id)
      ->Where('st.estado', 1)

      ->get()->getResultArray();